## Handling Missing Values

In [2]:
import pandas as pd 
import numpy as np

In [ ]:
1. Detect Null/Misssing Values
2. Fill Null Values
3. Drop Null Values Column

In [ ]:
1. df.isnull()
   df.isnull().sum()
2. df.isna()
   df.isna().sum()
3. df.fillna() # inplace=True
4. df.dropna() #Dropping rows
5. df.drop()   # Dropping Columns

In [ ]:
df.min()
df.max()
df.mean()
df.median()
stats.mode()

## 1. Detect Null Values

In [3]:
df = pd.read_csv('Emp_Records.csv')
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester
8,477616,Frances,58.18,42,23.27,121587,Delmita
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs

In [6]:
df = pd.read_csv('Emp_Records2.csv')
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [7]:
df.isnull() # True or False

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False
3,False,False,True,False,True,False,False
4,False,False,False,True,True,False,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [8]:
df.isnull().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [9]:
df.isna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False
3,False,False,True,False,True,False,False
4,False,False,False,True,True,False,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [10]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      100 non-null    object
 2   Age in Yrs      97 non-null     float64
 3   Weight in Kgs   97 non-null     float64
 4   Age in Company  96 non-null     float64
 5   Salary          99 non-null     float64
 6   City            100 non-null    object
dtypes: float64(4), int64(1), object(2)
memory usage: 5.6+ KB

## 2. Fill Missing Values

In [ ]:
df.fillna(value, inplace = True)

In [12]:
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont

In [13]:
df1 = df.fillna(1000)
df1.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,1000.0,0.98,50155.0,Michigantown
3,408351,Diane,1000.00,51.0,1000.00,180294.0,Hydetown
4,193819,Benjamin,40.31,1000.0,1000.00,117642.0,Fremont
5,499687,Patrick,1000.00,58.0,1000.00,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,1000.00,1000.0,1000.00,1000.0,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [15]:
df['Age in Yrs'] = df['Age in Yrs'].fillna(2000)
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,2000.00,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont

In [16]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [17]:
df = pd.read_csv('Emp_Records2.csv')
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [18]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [19]:
df['Age in Yrs'].mean()

39.074432989690735

In [20]:
df['Age in Yrs'] = df['Age in Yrs'].fillna(df['Age in Yrs'].mean())
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.360000,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.020000,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.150000,NaN,0.98,50155.0,Michigantown
3,408351,Diane,39.074433,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.310000,NaN,NaN,117642.0,Fremont

In [21]:
df['Weight in Kgs'].mean()

58.16494845360825

In [4]:
df['Weight in Kgs'] = df['Weight in Kgs'].fillna(df['Weight in Kgs'].mean())
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

In [23]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [24]:
mean_wt = df['Weight in Kgs'].mean()
med_wt  = df['Weight in Kgs'].median()
print(mean_wt)
print(med_wt)

58.16494845360825
56.0

In [25]:
df1['Weight in Kgs'] = df1['Weight in Kgs'].fillna(mean_wt)
df1.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.000000,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.000000,9.01,51063.0,Stonewall
2,428945,Joe,54.15,58.164948,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.000000,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,58.164948,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.000000,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.000000,0.87,98189.0,Atlanta
7,380086,Carol,NaN,58.164948,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.000000,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.000000,3.44,43010.0,Eureka Springs

In [26]:
from scipy import stats
stats.mode(df['Weight in Kgs'])

ModeResult(mode=array([60.]), count=array([11]))

In [28]:
df1['Age in Yrs'].fillna(df1['Age in Yrs'].mean(),inplace=True)
df1.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.360000,60.000000,13.68,168251.0,Denver
1,940761,Brenda,47.020000,60.000000,9.01,51063.0,Stonewall
2,428945,Joe,54.150000,58.164948,0.98,50155.0,Michigantown
3,408351,Diane,39.074433,51.000000,NaN,180294.0,Hydetown
4,193819,Benjamin,40.310000,58.164948,NaN,117642.0,Fremont
5,499687,Patrick,39.074433,58.000000,NaN,72305.0,Macksburg
6,539712,Nancy,22.140000,50.000000,0.87,98189.0,Atlanta
7,380086,Carol,39.074433,58.164948,NaN,NaN,Blanchester
8,477616,Frances,58.180000,42.000000,23.27,121587.0,Delmita
9,162402,Diana,29.730000,60.000000,3.44,43010.0,Eureka Springs

In [32]:
stats.mode(df1['City'])

ModeResult(mode=array(['Albion'], dtype=object), count=array([1]))

In [34]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,NaN
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,NaN
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [35]:
df['City'] = df['City'].fillna(df['City'].mode())
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Alma
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont

In [36]:
df['City'].mode()

0       Alma
1    Atqasuk
2    Bartley
dtype: object

In [37]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,NaN
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,NaN
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

## dropna

In [38]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              3
dtype: int64

In [39]:
df.dropna().head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [41]:
df.shape

(100, 7)

In [42]:
df.dropna(thresh=6) # In a row if there are 6 Non Null values, that row will not be deleted

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,60.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [43]:
df1.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,NaN
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,NaN
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [44]:
df.dropna(thresh=5) # In a row if there are 5 Non Null values, that row will not be deleted

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,60.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [46]:
df2 = df1[:11]
df2

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,NaN
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,NaN
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs
10,231469,Ralph,42.50,80.0,8.29,118457.0,Sabetha

In [48]:
df2.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              3
dtype: int64

In [49]:
df2.dropna(thresh=7)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs
10,231469,Ralph,42.50,80.0,8.29,118457.0,Sabetha

In [50]:
df2.dropna(thresh=6)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs
10,231469,Ralph,42.50,80.0,8.29,118457.0,Sabetha

In [51]:
df2.dropna(thresh=5)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs
10,231469,Ralph,42.50,80.0,8.29,118457.0,Sabetha

In [54]:
df2

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,NaN
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,NaN
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,NaN
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs
10,231469,Ralph,42.50,80.0,8.29,118457.0,Sabetha

In [55]:
df2.dropna(thresh=11,axis=1)

    Emp ID First Name
0   677509       Lois
1   940761     Brenda
2   428945        Joe
3   408351      Diane
4   193819   Benjamin
5   499687    Patrick
6   539712      Nancy
7   380086      Carol
8   477616    Frances
9   162402      Diana
10  231469      Ralph

In [56]:
df2.dropna(thresh=10,axis=1)

    Emp ID First Name    Salary
0   677509       Lois  168251.0
1   940761     Brenda   51063.0
2   428945        Joe   50155.0
3   408351      Diane  180294.0
4   193819   Benjamin  117642.0
5   499687    Patrick   72305.0
6   539712      Nancy   98189.0
7   380086      Carol       NaN
8   477616    Frances  121587.0
9   162402      Diana   43010.0
10  231469      Ralph  118457.0

In [57]:
df2.dropna(thresh=8,axis=1)

    Emp ID First Name  Age in Yrs  Weight in Kgs    Salary            City
0   677509       Lois       36.36           60.0  168251.0          Denver
1   940761     Brenda       47.02           60.0   51063.0       Stonewall
2   428945        Joe       54.15            NaN   50155.0             NaN
3   408351      Diane         NaN           51.0  180294.0        Hydetown
4   193819   Benjamin       40.31            NaN  117642.0         Fremont
5   499687    Patrick         NaN           58.0   72305.0             NaN
6   539712      Nancy       22.14           50.0   98189.0         Atlanta
7   380086      Carol         NaN            NaN       NaN             NaN
8   477616    Frances       58.18           42.0  121587.0         Delmita
9   162402      Diana       29.73           60.0   43010.0  Eureka Springs
10  231469      Ralph       42.50           80.0  118457.0         Sabetha

In [59]:
df1.dropna(thresh=100,axis=1)

    Emp ID First Name
0   677509       Lois
1   940761     Brenda
2   428945        Joe
3   408351      Diane
4   193819   Benjamin
..     ...        ...
95  639892       Jose
96  704709     Harold
97  461593     Nicole
98  392491    Theresa
99  495141      Tammy

[100 rows x 2 columns]

In [64]:
df1.drop(['Age in Yrs'],axis=1,inplace=True)

In [65]:
df1

    Emp ID First Name  Weight in Kgs  Age in Company    Salary          City
0   677509       Lois           60.0           13.68  168251.0        Denver
1   940761     Brenda           60.0            9.01   51063.0     Stonewall
2   428945        Joe            NaN            0.98   50155.0           NaN
3   408351      Diane           51.0             NaN  180294.0      Hydetown
4   193819   Benjamin            NaN             NaN  117642.0       Fremont
..     ...        ...            ...             ...       ...           ...
95  639892       Jose           89.0            1.05  129774.0        Biloxi
96  704709     Harold           77.0            5.93  156194.0  Carol Stream
97  461593     Nicole           60.0           28.53   95673.0       Detroit
98  392491    Theresa           57.0            6.99   51015.0      Mc Grath
99  495141      Tammy           55.0            2.26   93650.0          Alma

[100 rows x 6 columns]

In [67]:
df1.drop(1,axis=0)

    Emp ID First Name  Weight in Kgs  Age in Company    Salary          City
0   677509       Lois           60.0           13.68  168251.0        Denver
2   428945        Joe            NaN            0.98   50155.0           NaN
3   408351      Diane           51.0             NaN  180294.0      Hydetown
4   193819   Benjamin            NaN             NaN  117642.0       Fremont
5   499687    Patrick           58.0             NaN   72305.0           NaN
..     ...        ...            ...             ...       ...           ...
95  639892       Jose           89.0            1.05  129774.0        Biloxi
96  704709     Harold           77.0            5.93  156194.0  Carol Stream
97  461593     Nicole           60.0           28.53   95673.0       Detroit
98  392491    Theresa           57.0            6.99   51015.0      Mc Grath
99  495141      Tammy           55.0            2.26   93650.0          Alma

[99 rows x 6 columns]

In [69]:
df1.drop(['Salary','Age in Company'],axis=1)

    Emp ID First Name  Weight in Kgs          City
0   677509       Lois           60.0        Denver
1   940761     Brenda           60.0     Stonewall
2   428945        Joe            NaN           NaN
3   408351      Diane           51.0      Hydetown
4   193819   Benjamin            NaN       Fremont
..     ...        ...            ...           ...
95  639892       Jose           89.0        Biloxi
96  704709     Harold           77.0  Carol Stream
97  461593     Nicole           60.0       Detroit
98  392491    Theresa           57.0      Mc Grath
99  495141      Tammy           55.0          Alma

[100 rows x 4 columns]

In [100]:
df1= df.copy()
df1

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,John,36.36,100.0,13.68,168251.0,Mumbai
1,9876543456,Brenda,47.02,100.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,300.0,0.98,50155.0,Michigantown
3,408351,Diane,300.00,51.0,300.00,180294.0,Hydetown
4,193819,Benjamin,40.31,300.0,300.00,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,100.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [101]:
df1.drop(['Emp ID','First Name','City'],axis=1,inplace=True)
df1

    Age in Yrs  Weight in Kgs  Age in Company    Salary
0        36.36          100.0           13.68  168251.0
1        47.02          100.0            9.01   51063.0
2        54.15          300.0            0.98   50155.0
3       300.00           51.0          300.00  180294.0
4        40.31          300.0          300.00  117642.0
..         ...            ...             ...       ...
95       22.82           89.0            1.05  129774.0
96       32.61           77.0            5.93  156194.0
97       52.66          100.0           28.53   95673.0
98       29.60           57.0            6.99   51015.0
99       38.38           55.0            2.26   93650.0

[100 rows x 4 columns]

In [102]:
df1

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,John,36.36,100.0,13.68,168251.0,Mumbai
1,9876543456,Brenda,47.02,100.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,300.0,0.98,50155.0,Michigantown
3,408351,Diane,300.00,51.0,300.00,180294.0,Hydetown
4,193819,Benjamin,40.31,300.0,300.00,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,100.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [74]:
df1.drop(1:5,axis=0)

SyntaxError: invalid syntax (<ipython-input-74-b0eccc0caab5>, line 1)

In [ ]:
df1.drop(1,axis=0)

## replace()

In [76]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [98]:
df['Emp ID'].nunique()

100

In [99]:
df['First Name'].value_counts()

Nancy      4
Ann        2
Carolyn    2
Ernest     2
Melissa    2
          ..
Joan       1
Tammy      1
Peter      1
Dorothy    1
Alan       1
Name: First Name, Length: 79, dtype: int64

In [77]:
df.replace({'Denver':'Mumbai','Lois':'John'},inplace=True)

In [81]:
df.replace({60:100,np.nan:300},inplace=True)
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,John,36.36,100.0,13.68,168251.0,Mumbai
1,940761,Brenda,47.02,100.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,300.0,0.98,50155.0,Michigantown
3,408351,Diane,300.00,51.0,300.00,180294.0,Hydetown
4,193819,Benjamin,40.31,300.0,300.00,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,100.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [82]:
df['Emp ID'].replace({940761:9876543456},inplace=True)
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,John,36.36,100.0,13.68,168251.0,Mumbai
1,9876543456,Brenda,47.02,100.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,300.0,0.98,50155.0,Michigantown
3,408351,Diane,300.00,51.0,300.00,180294.0,Hydetown
4,193819,Benjamin,40.31,300.0,300.00,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,100.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [87]:
df.filter(regex='Sal|Age')

    Age in Yrs  Age in Company    Salary
0        36.36           13.68  168251.0
1        47.02            9.01   51063.0
2        54.15            0.98   50155.0
3       300.00          300.00  180294.0
4        40.31          300.00  117642.0
..         ...             ...       ...
95       22.82            1.05  129774.0
96       32.61            5.93  156194.0
97       52.66           28.53   95673.0
98       29.60            6.99   51015.0
99       38.38            2.26   93650.0

[100 rows x 3 columns]

In [90]:
df1['Age in Yrs'].quantile(0.25)

28.02

In [91]:
df1['Age in Yrs'].quantile(0.5)

37.57

In [92]:
df1['Age in Yrs'].quantile(0.75)

49.85

In [93]:
df1['Age in Yrs'].quantile(0.95)

58.156

In [96]:
df1['Age in Yrs'].quantile(0.99)

59.422000000000004

In [95]:
df1

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89.0,1.05,129774.0,Biloxi
96,704709,Harold,32.61,77.0,5.93,156194.0,Carol Stream
97,461593,Nicole,52.66,60.0,28.53,95673.0,Detroit
98,392491,Theresa,29.60,57.0,6.99,51015.0,Mc Grath
99,495141,Tammy,38.38,55.0,2.26,93650.0,Alma

In [105]:
a=5
a+10

15

In [107]:
a=a+10
a

15

In [108]:
a

15